In [186]:
import pandas as pd
import numpy as np

## DAY 1
#### Basics of DATAFRAME and SERIES

In [187]:
dict={"name":["hbhh","uhbj","jhj"],
      "age":[88,77,9]}

df=pd.DataFrame(dict)
df

   name  age
0  hbhh   88
1  uhbj   77
2   jhj    9

In [188]:
arr = [7,9,7]
s = pd.Series(arr)
s

0    7
1    9
2    7
dtype: int64

In [189]:
s=pd.Series([10,20,30],index=['a','b','c'])
d=pd.DataFrame({"name":["naja","naseef","akash","husna","swalih"],"age":[22,23,24,21,21]})
print(s)
print(d)

a    10
b    20
c    30
dtype: int64
     name  age
0    naja   22
1  naseef   23
2   akash   24
3   husna   21
4  swalih   21

In [190]:
#DataFrame from dictionary 
data={"name":["abc","xyz","uvw"],"roll_no":[1,3,2]}
df=pd.DataFrame(data,index=['a','b','c'])
print(df)
print(df.index)

  name  roll_no
a  abc        1
b  xyz        3
c  uvw        2
Index(['a', 'b', 'c'], dtype='object')

In [191]:
#data frame from numpy array
arr=np.array([[1,2,3],[4,5,6]])
df2=pd.DataFrame(arr,columns=['col1','col2','col3'])
print(df2)
print(df2.index)

   col1  col2  col3
0     1     2     3
1     4     5     6
RangeIndex(start=0, stop=2, step=1)

In [192]:
#dataframe from csv file
df3=pd.read_csv('Sample CSV file for importing contacts.csv')
df3

,Title,First Name,Middle Name,Last Name,Suffix,Company,Department,Job Title,Business Street,Business Street 2,...,Private,Profession,Referred By,Sensitivity,Spouse,User 1,User 2,User 3,User 4,Web Page
0,NaN,Anita,NaN,Jorgensen,NaN,Contoso,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,http://www.microsoft.com/
1,NaN,Anne-Mette,NaN,Olesen,NaN,Contoso,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,Dorena,NaN,Paschke,NaN,Contoso,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,Kemal,NaN,Celik,NaN,Contoso,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,Shiori,NaN,Inoue,NaN,Contoso,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#### .index
##### gives the indices like in the format (start,stop,step)

In [193]:
print(df3.index)

RangeIndex(start=0, stop=5, step=1)

#### .axes
##### returns a list of rows and column indexes or both row + column labels

In [194]:
print(df2.axes)
print(s.axes)

[RangeIndex(start=0, stop=2, step=1), Index(['col1', 'col2', 'col3'], dtype='object')]
[Index(['a', 'b', 'c'], dtype='object')]

#### .columns
##### shows all column labels or
##### can be used to give the column labels while creating a Dataframe

In [195]:
print(df.columns)

Index(['name', 'roll_no'], dtype='object')

In [196]:
arr=np.array([[1,2,3],[4,5,6]])
df2=pd.DataFrame(arr,columns=['col1','col2','col3'])
print(df2.columns)

Index(['col1', 'col2', 'col3'], dtype='object')

#### .shape
##### gives the dimensions of the DataFrame -> (rows,columns)

In [197]:
print(df3.shape)
print(df.shape)

(5, 92)
(3, 2)

#### .ndim
##### returns the number of dimensions
##### DataFrame -> 2
##### Series -> 1

In [198]:
print(df3.ndim)
print(df.ndim)
print(s.ndim)

2
2
1

#### .size
##### returns the total no.of elements(rows x columns)

In [199]:
print(df.size)
print(df3.size)
print(s.size)

6
460
3

#### .dtype
##### it shows the data type of each column

In [200]:
print(df.dtypes)

name       object
roll_no     int64
dtype: object

#### .T
###### this function returns the transpose of the Data frame (rows <-> colums)

In [201]:
print(df.T)

           a    b    c
name     abc  xyz  uvw
roll_no    1    3    2

In [202]:
li=np.arange(1,11)
sl=pd.Series(li)
sl

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [203]:
dd=pd.DataFrame({"country":["USA","Canada","India","Japan"],"capital":["Washington D C","Ottawa","Delhi","Tokyo"]})
dd

  country         capital
0     USA  Washington D C
1  Canada          Ottawa
2   India           Delhi
3   Japan           Tokyo

In [204]:
print(dd.shape)
print(dd.columns)

(4, 2)
Index(['country', 'capital'], dtype='object')

In [205]:
ar=np.array([[11,12,13,14,15],[1,2,3,4,5]])
ad=pd.DataFrame(ar)
ad

    0   1   2   3   4
0  11  12  13  14  15
1   1   2   3   4   5

In [206]:
print(ad.columns)

RangeIndex(start=0, stop=5, step=1)

In [207]:
print(ad.axes)

[RangeIndex(start=0, stop=2, step=1), RangeIndex(start=0, stop=5, step=1)]

##### there are many ways to rename a column name of a dataframe in pandas
##### here shows the way to rename multiple column name at once using key value pairs

In [208]:
dd=dd.rename(columns={"country":"country name","capital":"country capital"})
dd

  country name country capital
0          USA  Washington D C
1       Canada          Ottawa
2        India           Delhi
3        Japan           Tokyo

In [209]:
df['squared_roll_no']=df['roll_no']**2
print(df)

  name  roll_no  squared_roll_no
a  abc        1                1
b  xyz        3                9
c  uvw        2                4

## DAY 2
### Indexing and Selection

In [210]:
print(df)
print(df['roll_no'])

  name  roll_no  squared_roll_no
a  abc        1                1
b  xyz        3                9
c  uvw        2                4
a    1
b    3
c    2
Name: roll_no, dtype: int64

In [211]:
roll_column=df.roll_no
print(roll_column)

a    1
b    3
c    2
Name: roll_no, dtype: int64

#### .loc[] — label-based selection
##### Use .loc[row_labels, column_labels]
##### Works with row/column names (not positions)
##### Can select single rows/columns, slices, or boolean conditions

In [212]:
print(df.loc['b'])

name               xyz
roll_no              3
squared_roll_no      9
Name: b, dtype: object

In [213]:
d1=pd.DataFrame({'name':["naja","naseef","akash","husna","swalih"],'age':[22,23,24,21,21]},index=['01','02','03','04','05'])
print(d1.loc['03'])

name    akash
age        24
Name: 03, dtype: object

In [214]:
d1.index

Index(['01', '02', '03', '04', '05'], dtype='object')

In [215]:
d1.loc[['01','04'],['name']]

     name
01   naja
04  husna

In [216]:
d1.loc['01':'03','age']

01    22
02    23
03    24
Name: age, dtype: int64

In [217]:
d1['place']=['Calicut','Kottakkal','kutyadi','Manjeri','Vandoor']
print(d1)

      name  age      place
01    naja   22    Calicut
02  naseef   23  Kottakkal
03   akash   24    kutyadi
04   husna   21    Manjeri
05  swalih   21    Vandoor

In [218]:
d1.loc[['01','03'],['name','place']]

     name    place
01   naja  Calicut
03  akash  kutyadi

In [219]:
d1.loc[:,'age']

01    22
02    23
03    24
04    21
05    21
Name: age, dtype: int64

#### .iloc[] — position-based selection
##### Use .iloc[row_positions, column_positions]
##### Works with integer positions (like Python lists)

In [220]:
# to print a specific row
print(d1.iloc[4])

name      swalih
age           21
place    Vandoor
Name: 05, dtype: object

In [221]:
#to print specific column
print(d1.iloc[:,2])

01      Calicut
02    Kottakkal
03      kutyadi
04      Manjeri
05      Vandoor
Name: place, dtype: object

In [222]:
print(d1.iloc[1:4,1:3])

    age      place
02   23  Kottakkal
03   24    kutyadi
04   21    Manjeri

In [223]:
#printing last row , last column
print(d1.iloc[-1,-1])

Vandoor

#### Boolean Indexing
##### Boolean indexing = selecting rows based on conditions that give True or False.
##### The condition produces a Boolean Series (array of True/False values).
##### Pandas keeps only the rows where the condition is True.

In [224]:
d1['age']>22

01    False
02     True
03     True
04    False
05    False
Name: age, dtype: bool

In [225]:
#Apply mask to filter rows
d1[d1['age']>22] # onlt rows where age>22 is shown

      name  age      place
02  naseef   23  Kottakkal
03   akash   24    kutyadi

In [226]:
#combining multiple conditions
masked=(d1['age']>22) & (d1['place']=='kutyadi')
d1[masked]

     name  age    place
03  akash   24  kutyadi

##### Boolean Indexing with .loc[]

In [227]:
d1.loc[d1['age']>22,['name','place']] 
# Rows where age>22 , but show only name and place

      name      place
02  naseef  Kottakkal
03   akash    kutyadi

In [228]:

d1['salary']=[2000000,2600000,2000000,1500000,1700000]
print(d1)

      name  age      place   salary
01    naja   22    Calicut  2000000
02  naseef   23  Kottakkal  2600000
03   akash   24    kutyadi  2000000
04   husna   21    Manjeri  1500000
05  swalih   21    Vandoor  1700000

In [229]:
#Select the first 3 rows of a DataFrame
d1.loc['01':'03']

      name  age      place   salary
01    naja   22    Calicut  2000000
02  naseef   23  Kottakkal  2600000
03   akash   24    kutyadi  2000000

In [230]:
#Select only the Name column.
d1.loc[:,'name']

01      naja
02    naseef
03     akash
04     husna
05    swalih
Name: name, dtype: object

In [231]:
#Filter rows where Age > 21.
mask=d1['age']>21
print(d1[mask])

      name  age      place   salary
01    naja   22    Calicut  2000000
02  naseef   23  Kottakkal  2600000
03   akash   24    kutyadi  2000000

In [232]:
#Select rows 2–4 and columns Name and Age using iloc[].
d1.iloc[2:4,0:2]

     name  age
03  akash   24
04  husna   21

In [233]:
d1[(d1['salary']>1700000) & (d1['salary']<8000000)]

      name  age      place   salary
01    naja   22    Calicut  2000000
02  naseef   23  Kottakkal  2600000
03   akash   24    kutyadi  2000000

### DAY 3
#### Data cleaning and Missing values

In [234]:
data={'Name':['mary','james','alex','ravi','musthafa'],
      'Age':[22,32,None,22,32],
      'Place':['Kochi','Kochi','Alappuzha','calicut',None],
      'salary':[25000,30000,32000,'twenty five',35000]}
df=pd.DataFrame(data)
print(df)

       Name   Age      Place       salary
0      mary  22.0      Kochi        25000
1     james  32.0      Kochi        30000
2      alex   NaN  Alappuzha        32000
3      ravi  22.0    calicut  twenty five
4  musthafa  32.0       None        35000

In [235]:
#FINDING MISSING VALUES
print(df.isnull())

    Name    Age  Place  salary
0  False  False  False   False
1  False  False  False   False
2  False   True  False   False
3  False  False  False   False
4  False  False   True   False

In [236]:
#FINDING COLUMN WISE TOTAL NO.OF MISSING VALUES
print(df.isnull().sum())

Name      0
Age       1
Place     1
salary    0
dtype: int64

In [237]:
#DROPPING MISSING VALUES
#df.dropna(inplace=True)
df

       Name   Age      Place       salary
0      mary  22.0      Kochi        25000
1     james  32.0      Kochi        30000
2      alex   NaN  Alappuzha        32000
3      ravi  22.0    calicut  twenty five
4  musthafa  32.0       None        35000

In [238]:
# FILL MISSING VALUES
df['Age'].fillna(df['Age'].mean(),inplace=True)
df['Place'].fillna('unknown',inplace=True)
df

C:\Users\Admin\AppData\Local\Temp\ipykernel_16284\1565131261.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace=True)
C:\Users\Admin\AppData\Local\Temp\ipykernel_16284\1565131261.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Place'].fillna('unknown',inplace=True)

       Name   Age      Place       salary
0      mary  22.0      Kochi        25000
1     james  32.0      Kochi        30000
2      alex  27.0  Alappuzha        32000
3      ravi  22.0    calicut  twenty five
4  musthafa  32.0    unknown        35000

In [239]:
#REMOVE DUPLICATES
df.drop_duplicates(inplace=True)
df

       Name   Age      Place       salary
0      mary  22.0      Kochi        25000
1     james  32.0      Kochi        30000
2      alex  27.0  Alappuzha        32000
3      ravi  22.0    calicut  twenty five
4  musthafa  32.0    unknown        35000

In [240]:
#FIX DATA TYPES
df['salary']=pd.to_numeric(df['salary'],errors='coerce')
df
# errors='coerce' turns invalid entries (mismatched data types etc) into NaN

       Name   Age      Place   salary
0      mary  22.0      Kochi  25000.0
1     james  32.0      Kochi  30000.0
2      alex  27.0  Alappuzha  32000.0
3      ravi  22.0    calicut      NaN
4  musthafa  32.0    unknown  35000.0

In [241]:
#FILLING MISMATCHED DATA TYPE IN SALARY COLUMN
df['salary'].fillna(df['salary'].median(),inplace=True)
df

C:\Users\Admin\AppData\Local\Temp\ipykernel_16284\3257859425.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['salary'].fillna(df['salary'].median(),inplace=True)

       Name   Age      Place   salary
0      mary  22.0      Kochi  25000.0
1     james  32.0      Kochi  30000.0
2      alex  27.0  Alappuzha  32000.0
3      ravi  22.0    calicut  31000.0
4  musthafa  32.0    unknown  35000.0

In [242]:
#STANDARDIZED TEXT FORMATTING
df['Place']=df['Place'].str.title()
df

       Name   Age      Place   salary
0      mary  22.0      Kochi  25000.0
1     james  32.0      Kochi  30000.0
2      alex  27.0  Alappuzha  32000.0
3      ravi  22.0    Calicut  31000.0
4  musthafa  32.0    Unknown  35000.0

In [243]:
data1={
    "name":['alexander','akbar','ashok','shah jahan','tipu sulthan'],
    "age":[32,'sixty three',72,74,47],
    "city":['alexandria',np.nan,'patna','agra','srirangapatna'],
    'score':[90,23,None,14,88]
}
df1=pd.DataFrame(data1)
df1

           name          age           city  score
0     alexander           32     alexandria   90.0
1         akbar  sixty three            NaN   23.0
2         ashok           72          patna    NaN
3    shah jahan           74           agra   14.0
4  tipu sulthan           47  srirangapatna   88.0

In [244]:
df1.isnull()

    name    age   city  score
0  False  False  False  False
1  False  False   True  False
2  False  False  False   True
3  False  False  False  False
4  False  False  False  False

In [245]:
df1.isnull().sum()

name     0
age      0
city     1
score    1
dtype: int64

In [246]:
df1['city'].fillna('unknown',inplace=True)
df1['score'].fillna(df1['score'].mean(), inplace=True)
df1

C:\Users\Admin\AppData\Local\Temp\ipykernel_16284\4284537063.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['city'].fillna('unknown',inplace=True)
C:\Users\Admin\AppData\Local\Temp\ipykernel_16284\4284537063.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['score'].fillna(df1['score'].mean(), inplace=True)

           name          age           city  score
0     alexander           32     alexandria  90.00
1         akbar  sixty three        unknown  23.00
2         ashok           72          patna  53.75
3    shah jahan           74           agra  14.00
4  tipu sulthan           47  srirangapatna  88.00

In [247]:
df1['age']=pd.to_numeric(df1['age'], errors='coerce')
df1

           name   age           city  score
0     alexander  32.0     alexandria  90.00
1         akbar   NaN        unknown  23.00
2         ashok  72.0          patna  53.75
3    shah jahan  74.0           agra  14.00
4  tipu sulthan  47.0  srirangapatna  88.00

In [248]:
df1['age'].fillna(df1['age'].median(),inplace=True)
df1

C:\Users\Admin\AppData\Local\Temp\ipykernel_16284\3245229526.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['age'].fillna(df1['age'].median(),inplace=True)

           name   age           city  score
0     alexander  32.0     alexandria  90.00
1         akbar  59.5        unknown  23.00
2         ashok  72.0          patna  53.75
3    shah jahan  74.0           agra  14.00
4  tipu sulthan  47.0  srirangapatna  88.00

In [249]:
df1['city'].replace('unknown','not specified',inplace=True)
df1

C:\Users\Admin\AppData\Local\Temp\ipykernel_16284\418708295.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['city'].replace('unknown','not specified',inplace=True)

           name   age           city  score
0     alexander  32.0     alexandria  90.00
1         akbar  59.5  not specified  23.00
2         ashok  72.0          patna  53.75
3    shah jahan  74.0           agra  14.00
4  tipu sulthan  47.0  srirangapatna  88.00

In [250]:
df1['city']=df1['city'].str.title()
df1

           name   age           city  score
0     alexander  32.0     Alexandria  90.00
1         akbar  59.5  Not Specified  23.00
2         ashok  72.0          Patna  53.75
3    shah jahan  74.0           Agra  14.00
4  tipu sulthan  47.0  Srirangapatna  88.00

In [251]:
df1['city'].replace('Not Specified','Fatehpur Sikri',inplace=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_16284\3055484546.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df1['city'].replace('Not Specified','Fatehpur Sikri',inplace=True)

In [252]:
print(df1)

           name   age            city  score
0     alexander  32.0      Alexandria  90.00
1         akbar  59.5  Fatehpur Sikri  23.00
2         ashok  72.0           Patna  53.75
3    shah jahan  74.0            Agra  14.00
4  tipu sulthan  47.0   Srirangapatna  88.00

#### Day 4
#####  Sorting & Operations

##### 1.Sorting by index

In [253]:
print(df1)

           name   age            city  score
0     alexander  32.0      Alexandria  90.00
1         akbar  59.5  Fatehpur Sikri  23.00
2         ashok  72.0           Patna  53.75
3    shah jahan  74.0            Agra  14.00
4  tipu sulthan  47.0   Srirangapatna  88.00

In [254]:
df1.index=['a','d','e','c','b']
df1

           name   age            city  score
a     alexander  32.0      Alexandria  90.00
d         akbar  59.5  Fatehpur Sikri  23.00
e         ashok  72.0           Patna  53.75
c    shah jahan  74.0            Agra  14.00
b  tipu sulthan  47.0   Srirangapatna  88.00

In [255]:
print("Sorted by index: \n")
print(df1.sort_index())

Sorted by index:

           name   age            city  score
a     alexander  32.0      Alexandria  90.00
b  tipu sulthan  47.0   Srirangapatna  88.00
c    shah jahan  74.0            Agra  14.00
d         akbar  59.5  Fatehpur Sikri  23.00
e         ashok  72.0           Patna  53.75

##### 2.Sorting by column values

In [256]:
print(df1.sort_values(by='age'))

           name   age            city  score
a     alexander  32.0      Alexandria  90.00
b  tipu sulthan  47.0   Srirangapatna  88.00
d         akbar  59.5  Fatehpur Sikri  23.00
e         ashok  72.0           Patna  53.75
c    shah jahan  74.0            Agra  14.00

##### sorting by column values in descending order

In [257]:
print(df1.sort_values(by='age',ascending=False))

           name   age            city  score
c    shah jahan  74.0            Agra  14.00
e         ashok  72.0           Patna  53.75
d         akbar  59.5  Fatehpur Sikri  23.00
b  tipu sulthan  47.0   Srirangapatna  88.00
a     alexander  32.0      Alexandria  90.00

##### 3.Sorting by multiple columns

In [258]:
print(df1.sort_values(by=['age','score'],ascending=True))

           name   age            city  score
a     alexander  32.0      Alexandria  90.00
b  tipu sulthan  47.0   Srirangapatna  88.00
d         akbar  59.5  Fatehpur Sikri  23.00
e         ashok  72.0           Patna  53.75
c    shah jahan  74.0            Agra  14.00

##### 3.Using nlargest() and nsmallest()
###### useful when you need top n or bottom n rows by a column

In [259]:
print(df1.nsmallest(2,'age'))

           name   age           city  score
a     alexander  32.0     Alexandria   90.0
b  tipu sulthan  47.0  Srirangapatna   88.0

In [260]:
print(df1.nlargest(3,'score'))

           name   age           city  score
a     alexander  32.0     Alexandria  90.00
b  tipu sulthan  47.0  Srirangapatna  88.00
e         ashok  72.0          Patna  53.75

##### 4.Sorting using rank()

In [261]:
df1['score_rank']=df1['score'].rank()
print(df1)

           name   age            city  score  score_rank
a     alexander  32.0      Alexandria  90.00         5.0
d         akbar  59.5  Fatehpur Sikri  23.00         2.0
e         ashok  72.0           Patna  53.75         3.0
c    shah jahan  74.0            Agra  14.00         1.0
b  tipu sulthan  47.0   Srirangapatna  88.00         4.0

In [262]:

print(df1.sort_index())

           name   age            city  score  score_rank
a     alexander  32.0      Alexandria  90.00         5.0
b  tipu sulthan  47.0   Srirangapatna  88.00         4.0
c    shah jahan  74.0            Agra  14.00         1.0
d         akbar  59.5  Fatehpur Sikri  23.00         2.0
e         ashok  72.0           Patna  53.75         3.0

##### Operations in pandas

##### Arithmatic operations on columns

In [263]:
df1['double score']=df1['score']*2
df1['age plus 5']=df1['age']+5
df1

,name,age,city,score,score_rank,double score,age plus 5
a,alexander,32.0,Alexandria,90.00,5.0,180.0,37.0
d,akbar,59.5,Fatehpur Sikri,23.00,2.0,46.0,64.5
e,ashok,72.0,Patna,53.75,3.0,107.5,77.0
c,shah jahan,74.0,Agra,14.00,1.0,28.0,79.0
b,tipu sulthan,47.0,Srirangapatna,88.00,4.0,176.0,52.0

##### Operations between columns

In [264]:
df1['age + score']=df1['age']+df1['score']
df1

,name,age,city,score,score_rank,double score,age plus 5,age + score
a,alexander,32.0,Alexandria,90.00,5.0,180.0,37.0,122.00
d,akbar,59.5,Fatehpur Sikri,23.00,2.0,46.0,64.5,82.50
e,ashok,72.0,Patna,53.75,3.0,107.5,77.0,125.75
c,shah jahan,74.0,Agra,14.00,1.0,28.0,79.0,88.00
b,tipu sulthan,47.0,Srirangapatna,88.00,4.0,176.0,52.0,135.00

##### Applying functions
##### can use .apply() function to run custom functions on a column or row

In [265]:
df1['age squared']=df1['age'].apply(lambda x:x**2)
df1

,name,age,city,score,score_rank,double score,age plus 5,age + score,age squared
a,alexander,32.0,Alexandria,90.00,5.0,180.0,37.0,122.00,1024.00
d,akbar,59.5,Fatehpur Sikri,23.00,2.0,46.0,64.5,82.50,3540.25
e,ashok,72.0,Patna,53.75,3.0,107.5,77.0,125.75,5184.00
c,shah jahan,74.0,Agra,14.00,1.0,28.0,79.0,88.00,5476.00
b,tipu sulthan,47.0,Srirangapatna,88.00,4.0,176.0,52.0,135.00,2209.00

##### Aggregation functions

In [266]:
df2 = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "David"],
    "age": [25, 30, 35, 40],
    "score": [90, 80, 95, 70]
})
df2

      name  age  score
0    Alice   25     90
1      Bob   30     80
2  Charlie   35     95
3    David   40     70

In [267]:
print("sum of age: ",df2['age'].sum())
print("mean score: ",df2['score'].mean())
print("minimum age: ",df2['age'].min())
print("maximum score: ",df2['score'].max())
print("count of people: ",df2['name'].count())
print("standard deviation of age: ",df2['age'].std())
print("varience of score: ",df2['score'].var())

sum of age:  130
mean score:  83.75
minimum age:  25
maximum score:  95
count of people:  4
standard deviation of age:  6.454972243679028
varience of score:  122.91666666666667

In [268]:
print(df2.mean)

<bound method DataFrame.mean of       name  age  score
0    Alice   25     90
1      Bob   30     80
2  Charlie   35     95
3    David   40     70>

##### Using .agg() for multiple aggregations

In [269]:
print(df2['age'].agg(['min','max','mean','median','count','std']))

min       25.000000
max       40.000000
mean      32.500000
median    32.500000
count      4.000000
std        6.454972
Name: age, dtype: float64